Revit 2017 API
ElementReferenceType Enumeration
Element reference types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public enum ElementReferenceType
Visual Basic
Public Enumeration ElementReferenceType
Visual C++
public enum class ElementReferenceType
Members
Member name | Description
REFERENCE_TYPE_NONE | The reference is to an element.
REFERENCE_TYPE_LINEAR | The reference is to a curve or edge.
REFERENCE_TYPE_SURFACE | The reference is to a face or face region.
REFERENCE_TYPE_FOREIGN | The reference is to geometry or elements in linked Revit file.
REFERENCE_TYPE_INSTANCE | The reference is an instance of a symbol.
REFERENCE_TYPE_CUT_EDGE | The reference is to a face that was cut (where the original pick was made on the cut edge).
REFERENCE_TYPE_MESH | The reference is to a mesh.
See Also
Autodesk.Revit.DB Namespace